a=[]
a.append({"标题":"科技发展新动态","分类":"科技"})
a.append({"标题":"股市最新消息","分类":"财经"})
a.append({"标题":"最新科技产品评测","分类":"科技"})
a.append({"标题":"国际油价波动","分类":"财经"})
a.append({"标题":"体育赛事报道","分类":"体育"})
a.append({"标题":"网络安全新威胁","分类":"科技"})
a.append({"标题":"金融市场分析","分类":"财经"})
a.append({"标题":"艺术展览开幕","分类":"文化"})
a.append({"标题":"环保政策解读","分类":"环保"})
a.append({"标题":"健康生活小贴士","分类":"健康"})
b={}
for i in a:
    c=i["分类"]
    if c in b:
        b[c] += 1
    else:
        b[c] = 1
for i in b:
    print(i+"的数量是"+str(b[i]))
